//中文标点
//ChinesePunctuation

#define ： :
#define ； ;
//C3873: “0x2018”: 不允许将此字符作为标识符的第一个字符 C2001: 常量中有换行符 #define ‘ '
//C3873: “0x2019”: 不允许将此字符作为标识符的第一个字符 C2001: 常量中有换行符 #define ’ '
//C3873: “0x201C”: 不允许将此字符作为标识符的第一个字符 C2001: 常量中有换行符 #define “ "
//C3873: “0x201D”: 不允许将此字符作为标识符的第一个字符 C2001: 常量中有换行符 #define ” "
#define ， ,
//C3873: “0x3002”: 不允许将此字符作为标识符的第一个字符 #define 。 .
#define ！ !
#define ？ ?
//C3873: “0x3001”: 不允许将此字符作为标识符的第一个字符 #define 、 ,
#define （ (
#define ） )
#define ￥ $
//C3873 : “0x3010”: 不允许将此字符作为标识符的第一个字符 #define 【 [
//C3873 : “0x3011”: 不允许将此字符作为标识符的第一个字符 #define 】 ]
//C3873 : “0x301A”: 不允许将此字符作为标识符的第一个字符 #define 《 <
//C3873 : “0x301B”: 不允许将此字符作为标识符的第一个字符 #define 》 >